#a=['bael',12,34,'kanat','egida',546,23,'kiri','anna',]
#a.extend(b)

# a=[]
# b=('help','namber')
# t=(1,87)
# c=('hello',)
# d=('bema',)
# n=('rikki','gyuio')
# a.append(b)
# a.append(t)
# a.append(c)
# a.append(d)
# a.append(n)
# print(a)


# a=('nano','hello','maney')
# print(a[2])



# a=(1,2.3,'vova',True,'hello')
# print(a)




# a=('Talant','Bema','Tina','Tima','Sezim')
# b=''.join(a)
# print(b)




# a=[112,1.24,'hello','xs']
# b=['baby',46,'lili','rikki']
# a.append(a)
# a.append(b)
# print(a)

# a =['Jack','Jimmy','Jackson','Jhon','Jeckson','Jhon','Jimmy','Jeckson','Jhon','Jeckson','Jhon','Jack','Jhon','Jack']
# # a.remove('Nina')
# # print(a)



#######################
# # Лист №1:
# a = ['Jack', 'Jimmy', 'Jackson', 'Jhon', 'Jackson', 'Jhon',  'Jimmy', 'Jackson', 'Jhon','Jack', 'Jimmy', 'Jack', 'Jackson', 'Jhon', 'Jackson', 'Jhon','Jack', 'Jimmy', 'Jack', 'Jackson', 'Jhon',]
# b =a.count('Jack')
# print(b)






# a=[]
# a.append('Aibarchyn')
# a.append(2004)
# a.append('pythot')
# print(a)


# a=list(range(1,100,2))
# print(a)



# a=list(range(16,100,20))
# a.reverse()
# print(a)



# print([i for i in 'hello world'.split])





# text = 'hello world'
# s = text.split()
# print(s)





Endless Key, [21/7/22 22:49]
[В ответ на Nikiman]
Ууее 😂

kiri, [22/7/22 09:33]
добое утро

kiri, [22/7/22 09:35]
faster

kiri, [22/7/22 10:56]
#######################
# # Лист №1:
# names = ['Jack', 'Jimmy', 'Jackson', 'Jhon', 'Jackson', 'Jhon',  'Jimmy', 'Jackson', 'Jhon','Jack', 'Jimmy', 'Jack', 'Jackson', 'Jhon', 'Jackson', 'Jhon','Jack', 'Jimmy', 'Jack', 'Jackson', 'Jhon',]

# Задача 1
# Есть список:
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# Выведите все элементы, которые больше 5.

#Задача 2
# Есть набор чисел 
# digits = (113,118,-5,1,135,137,0,142,144,17,154,0,155,2,159,172)
# Поделить каждое число из digits на 9 и вывести на экран.

#Задача 3
# fruits = ('banana','stawberry','apple','orange','limon','ananas')
# Выведите первый и последний элемент списка.

# Задача 4 
# Здесь замешаны разные типы данных. Если вы уверены что логика написана правильно, но оно всё равно не работает скорее всего вы справились с заданием
# Напишите программу, которая берёт массив данных spisok2 и выводит только те элементы из spisok_2, которых нет в spisok_1.
# spisok_1 = ('Lamborgini', 17, '4456', 2020, 'Paris', 'USA', 11, 23)
# spisok_2 = ('Ferrari', 17, 4456, 2021, 'Paris', 'UK', 777, 23)

# Задача 5
# Напишите программу, которая выводит чётные числа из списка длиною 300 объектов
#    и останавливается, если встречает число 237.

###################################################################LIST №3

numbers = [123, 321, 2, 543, 64, 463, 234, 867, 6234, 63246, 3, 43]
#################################################################LIST №2
pythonList = ["int", "str", "bool", "if", "else", "elif", "loop", "tuple", "list", "None", True, False]
~

# Задание 6:
# Дан список  целых чисел:
# numbers = [0,2,4,7,1,8,0,-3,7,0,-2,4,0,0,-1,7,-43,0,8,-3,6,9]
# Создайте новый лист и замените отрицательные числа на -1, положительные на число 1, ноль оставить без изменения.


# ################################################################################
# # Практические задания: Tuples and Lists
# ################################################################################
# # Лист №1:
# names = ['Jack', 'Jimmy', 'Jackson', 'Jhon', 'Jackson', 'Jhon',  'Jimmy', 'Jackson', 'Jhon','Jack', 'Jimmy', 'Jack', 'Jackson', 'Jhon', 'Jackson', 'Jhon','Jack', 'Jimmy', 'Jack', 'Jackson', 'Jhon',]


# Задача 1
# Есть список:
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# Выведите все элементы, которые больше 5.

#Задача 2
# Есть набор чисел 
# digits = (113,118,-5,1,135,137,0,142,144,17,154,0,155,2,159,172)
# Поделить каждое число из digits на 9 и вывести на экран.


#Задача 3
# fruits = ('banana','stawberry','apple','orange','limon','ananas')
# Выведите первый и последний элемент списка.

# Задача 4 
# Здесь замешаны разные типы данных. Если вы уверены что логика написана правильно, но оно всё равно не работает скорее всего вы справились с заданием
# Напишите программу, которая берёт массив данных spisok2 и выводит только те элементы из spisok_2, которых нет в spisok_1.
# spisok_1 = ('Lamborgini', 17, '4456', 2020, 'Paris', 'USA', 11, 23)
# spisok_2 = ('Ferrari', 17, 4456, 2021, 'Paris', 'UK', 777, 23)

# Задача 5
# Напишите программу, которая выводит чётные числа из списка длиною 300 объектов
#    и останавливается, если встречает число 237.



a = ["int", "str", "bool", "if", "else", "elif", "loop", "tuple", "list", "None", True, False]






start = int(input(
    'Введите старт: '
))

stop = int(input(
    'Введите stop: '
))

step = int(input(
    'Введите step: '
))

if step <= 0:
    print('шак не может быть меньше 1')

else:
    lst = list(range(start, stop+1, step))
    print(lst)